AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетПоказанийПриборовУчета.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетПоказанийПриборовУчетаИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетПоказанийПриборовУчетаИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияРасчетПоказанийПриборовУчетаИзменение Тогда
		
		// Если временная таблица "ДвиженияРасчетПоказанийПриборовУчетаИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасчетПоказанийПриборовУчета.НомерСтроки КАК НомерСтроки,
		|	РасчетПоказанийПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	РасчетПоказанийПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	РасчетПоказанийПриборовУчета.Услуга КАК Услуга,
		|	РасчетПоказанийПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВЫБОР
		|		КОГДА РасчетПоказанийПриборовУчета.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетПоказанийПриборовУчета.Значение
		|		ИНАЧЕ -РасчетПоказанийПриборовУчета.Значение
		|	КОНЕЦ КАК ЗначениеПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью
		|ИЗ
		|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
		|ГДЕ
		|	РасчетПоказанийПриборовУчета.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияРасчетПоказанийПриборовУчетаИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа,
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ЗначениеПередЗаписью КАК ЗначениеПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью
		|ИЗ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетПоказанийПриборовУчета.НомерСтроки,
		|	РасчетПоказанийПриборовУчета.ОбъектУстановки,
		|	РасчетПоказанийПриборовУчета.ПриборУчета,
		|	РасчетПоказанийПриборовУчета.Услуга,
		|	РасчетПоказанийПриборовУчета.ВидТарифа,
		|	ВЫБОР
		|		КОГДА РасчетПоказанийПриборовУчета.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетПоказанийПриборовУчета.Значение
		|		ИНАЧЕ -РасчетПоказанийПриборовУчета.Значение
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
		|ГДЕ
		|	РасчетПоказанийПриборовУчета.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияРасчетПоказанийПриборовУчетаИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетПоказанийПриборовУчетаИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетПоказанийПриборовУчетаИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияРасчетПоказанийПриборовУчетаИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияРасчетПоказанийПриборовУчетаИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияРасчетПоказанийПриборовУчетаИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа,
	|	СУММА(ДвиженияРасчетПоказанийПриборовУчетаИзменение.ЗначениеПередЗаписью) КАК ЗначениеПередЗаписью,
	|	СУММА(ДвиженияРасчетПоказанийПриборовУчетаИзменение.ЗначениеИзменение) КАК ЗначениеИзменение,
	|	СУММА(ДвиженияРасчетПоказанийПриборовУчетаИзменение.ЗначениеПриЗаписи) КАК ЗначениеПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетПоказанийПриборовУчетаИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.ОбъектУстановки КАК ОбъектУстановки,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.ПриборУчета КАК ПриборУчета,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.Услуга КАК Услуга,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.ВидТарифа КАК ВидТарифа,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.ЗначениеПередЗаписью КАК ЗначениеПередЗаписью,
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью.ЗначениеПередЗаписью КАК ЗначениеИзменение,
	|		0 КАК ЗначениеПриЗаписи
	|	ИЗ
	|		ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью КАК ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.НомерСтроки,
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.ОбъектУстановки,
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.ПриборУчета,
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.Услуга,
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.ВидТарифа,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.Значение
	|			ИНАЧЕ ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.Значение
	|		КОНЕЦ,
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.Значение
	|	ИЗ
	|		РегистрНакопления.РасчетПоказанийПриборовУчета КАК ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи
	|	ГДЕ
	|		ДвиженияРасчетПоказанийПриборовУчетаПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга,
	|	ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияРасчетПоказанийПриборовУчетаИзменение.ЗначениеИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУстановки,
	|	ПриборУчета,
	|	Услуга,
	|	ВидТарифа");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияРасчетПоказанийПриборовУчетаИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетПоказанийПриборовУчетаИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетПоказанийПриборовУчетаПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()
